configuration/src/InformationRegisters/ExchangeMessageArchiveSettings/ExchangeMessageArchiveSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ExchangeMessageArchiveSettings</name>
  <resources>
    <name>FilesCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>StoreOnDisk</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FullPath</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FullPathLinux</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ShouldCompressFiles</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>InfobaseNode</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ExchangeMessageArchiveSettings/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Function GetSettings(InfobaseNode) Export
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	Settings.InfobaseNode AS InfobaseNode,
		|	Settings.FilesCount AS FilesCount,
		|	Settings.StoreOnDisk AS StoreOnDisk,
		|	Settings.FullPath AS FullPath,
		|	Settings.ShouldCompressFiles AS ShouldCompressFiles
		|FROM
		|	InformationRegister.ExchangeMessageArchiveSettings AS Settings
		|WHERE
		|	Settings.InfobaseNode = &InfobaseNode";
	
	Query.SetParameter("InfobaseNode", InfobaseNode);
	
	Selection = Query.Execute().Select();
	
	If Selection.Next() Then
		Result = New Structure("FilesCount,StoreOnDisk,FullPath,ShouldCompressFiles");
		FillPropertyValues(Result, Selection);
		Return Result;
	Else
		Return Undefined;
	EndIf;
	
EndFunction

#EndRegion

#EndIf
